Cargar datos y crear copia del dataset

In [165]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

tabla empleados

In [166]:
%pip install openpyxl

data = pd.read_excel("BD_Prueba.xlsx", sheet_name='empleados')
data

Requirement already satisfied: openpyxl in c:\estudio\prueba_tecnica_analista_datos_junior\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\estudio\prueba_tecnica_analista_datos_junior\.venv\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

       id         nombre salario  departamento_id
0       1     Empleado_1    3000             61.0
1       2     Empleado_2    2000             38.0
2       3     Empleado_3    1000             22.0
3       4     Empleado_4  dosmil             69.0
4       5     Empleado_5    3000             23.0
..    ...            ...     ...              ...
995   996   Empleado_996    -100              5.0
996   997   Empleado_997    3000             59.0
997   998   Empleado_998    2000             38.0
998   999   Empleado_999    2000             15.0
999  1000  Empleado_1000    -100             53.0

[1000 rows x 4 columns]

In [167]:
data.dtypes

id                   int64
nombre              object
salario             object
departamento_id    float64
dtype: object

In [168]:
print('\nEstadística de datos en el DataFrame:')  
data.describe()

Estadística de datos en el DataFrame:

                id  departamento_id
count  1000.000000       985.000000
mean    500.500000        35.714721
std     288.819436        20.201848
min       1.000000         1.000000
25%     250.750000        18.000000
50%     500.500000        36.000000
75%     750.250000        54.000000
max    1000.000000        69.000000

In [169]:
print('Datos nulos en el DataFrame:')
data.isnull().sum()

Datos nulos en el DataFrame:

id                   0
nombre               0
salario            128
departamento_id     15
dtype: int64

In [170]:
unique_values = {col : data[col].unique() for col in data.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 1000
Valores únicos: [ 1  2  3  4  5  6  7  8  9 10]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 1000
Valores únicos: ['Empleado_1' 'Empleado_2' 'Empleado_3' 'Empleado_4' 'Empleado_5'
 'Empleado_6' 'Empleado_7' 'Empleado_8' 'Empleado_9' 'Empleado_10']
--------------------------------------------------
columna:  salario
Número devalores únicos: 7
Valores únicos: [3000 2000 1000 'dosmil' 999999 nan -100]
--------------------------------------------------
columna:  departamento_id
Número devalores únicos: 70
Valores únicos: [61. 38. 22. 69. 23. 28. 36. 40. 44. 35.]
--------------------------------------------------

In [171]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               1000 non-null   int64
 1   nombre           1000 non-null   object
 2   salario          872 non-null    object
 3   departamento_id  985 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 31.4+ KB

eliminar datos nulos de salario

In [172]:

data = data.dropna(subset=['salario'])

verificar

In [173]:
print('Datos nulos en el DataFrame:')
data.isnull().sum()

Datos nulos en el DataFrame:

id                  0
nombre              0
salario             0
departamento_id    13
dtype: int64

eliminar datos nulos de departamento id

In [174]:
data = data.dropna(subset=['departamento_id'])

In [175]:
print('Datos nulos en el DataFrame:')
data.isnull().sum()

Datos nulos en el DataFrame:

id                 0
nombre             0
salario            0
departamento_id    0
dtype: int64

verificar nuevamente valores unicos

In [176]:
unique_values = {col : data[col].unique() for col in data.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 859
Valores únicos: [ 1  2  3  4  5  6  7  8  9 10]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 859
Valores únicos: ['Empleado_1' 'Empleado_2' 'Empleado_3' 'Empleado_4' 'Empleado_5'
 'Empleado_6' 'Empleado_7' 'Empleado_8' 'Empleado_9' 'Empleado_10']
--------------------------------------------------
columna:  salario
Número devalores únicos: 6
Valores únicos: [3000 2000 1000 'dosmil' 999999 -100]
--------------------------------------------------
columna:  departamento_id
Número devalores únicos: 69
Valores únicos: [61. 38. 22. 69. 23. 28. 36. 40. 44. 35.]
--------------------------------------------------

salario tengo valores en salario tipo string de dosmil debo cambiar a 2000 y eliminar valores negativos como el de -100

In [177]:
data['salario'] = data['salario'].replace('dosmil', 2000)

C:\Users\damak\AppData\Local\Temp\ipykernel_6016\2281760398.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['salario'] = data['salario'].replace('dosmil', 2000)

In [178]:
data = data[data['salario'] >= 0]

In [179]:
data['salario'] = data['salario'].astype(int)
data['salario'].dtype

dtype('int64')

## tabla departamentos

In [180]:
data_dos = pd.read_excel("BD_Prueba.xlsx", sheet_name='departamentos')
data_dos.head()

   id  nombre
0   1  Ventas
1   2      IT
2   3      IT
3   4      IT
4   5    RRHH

In [181]:
data_dos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      50 non-null     int64
 1   nombre  45 non-null     object
dtypes: int64(1), object(1)
memory usage: 932.0+ bytes

verificar datos nulos

In [182]:
print('Datos nulos en el DataFrame departamento:')
data_dos.isnull().sum()

Datos nulos en el DataFrame departamento:

id        0
nombre    5
dtype: int64

In [183]:
data_dos = data_dos.dropna(subset=['nombre'])

In [184]:
print('Datos nulos en el DataFrame departamento:')
data_dos.isnull().sum()

Datos nulos en el DataFrame departamento:

id        0
nombre    0
dtype: int64

In [185]:
unique_values = {col : data_dos[col].unique() for col in data_dos.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 45
Valores únicos: [ 1  2  3  4  5  6  7  9 11 12]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 4
Valores únicos: ['Ventas' 'IT' 'RRHH' '123']
--------------------------------------------------

eliminar valores de nombre de departamento como 123

In [186]:
data_dos = data_dos[data_dos['nombre'].apply(lambda x: isinstance(x, str) and not x.isdigit())]

verificación de los datos

In [187]:
unique_values = {col : data_dos[col].unique() for col in data_dos.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 34
Valores únicos: [ 1  2  3  4  5  6  7  9 11 12]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 3
Valores únicos: ['Ventas' 'IT' 'RRHH']
--------------------------------------------------

## tabla compras

In [188]:
data_tres = pd.read_excel("BD_Prueba.xlsx", sheet_name='compras')
data_tres.head()

   id  cliente_id      fecha monto
0   1         191 2021-11-16   abc
1   2         548 2022-07-12   -50
2   3         604 2021-07-21   abc
3   4        2255 2020-04-01   NaN
4   5        2022 2022-07-20   100

In [189]:
data_tres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10000 non-null  int64
 1   cliente_id  10000 non-null  int64
 2   fecha       9996 non-null   datetime64[ns]
 3   monto       8714 non-null   object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 312.6+ KB

In [190]:
print('Datos nulos en el DataFrame compras:')
data_tres.isnull().sum()

Datos nulos en el DataFrame compras:

id               0
cliente_id       0
fecha            4
monto         1286
dtype: int64

cambiar la fecha a datetime y eliminar nulos

In [191]:
data_tres['fecha'] = pd.to_datetime(data_tres['fecha'], errors='coerce')
data_tres = data_tres.dropna(subset=['fecha'])

Poner cero en los datos de compras nulos

In [192]:
unique_values = {col : data_tres[col].unique() for col in data_tres.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 9996
Valores únicos: [ 1  2  3  4  5  6  7  8  9 10]
--------------------------------------------------
columna:  cliente_id
Número devalores únicos: 2454
Valores únicos: [ 191  548  604 2255 2022 1564  185  244  955  158]
--------------------------------------------------
columna:  fecha
Número devalores únicos: 1764
Valores únicos: <DatetimeArray>
['2021-11-16 00:00:00', '2022-07-12 00:00:00', '2021-07-21 00:00:00',
 '2020-04-01 00:00:00', '2022-07-20 00:00:00', '2020-11-24 00:00:00',
 '2021-03-13 00:00:00', '2022-05-07 00:00:00', '2023-02-25 00:00:00',
 '2024-11-17 00:00:00']
Length: 10, dtype: datetime64[ns]
--------------------------------------------------
columna:  monto
Número devalores únicos: 8
Valores únicos: ['abc' -50 nan 100 1000000 200 5000 300]
--------------------------------------------------

quitar duplicados de cliente_id

In [193]:
data_tres = data_tres.drop_duplicates(subset=['cliente_id'])

quitar valores de abc de la columna monto y cambiar los nan por 0

In [194]:
data_tres = data_tres[data_tres["monto"] != "abc"]

In [195]:
data_tres["monto"] = data_tres["monto"].fillna(0)

C:\Users\damak\AppData\Local\Temp\ipykernel_6016\3893307774.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data_tres["monto"] = data_tres["monto"].fillna(0)

In [196]:
unique_values = {col : data_tres[col].unique() for col in data_tres.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 2155
Valores únicos: [ 2  4  5  6  7  8  9 10 11 14]
--------------------------------------------------
columna:  cliente_id
Número devalores únicos: 2155
Valores únicos: [ 548 2255 2022 1564  185  244  955  158 2028 1136]
--------------------------------------------------
columna:  fecha
Número devalores únicos: 1180
Valores únicos: <DatetimeArray>
['2022-07-12 00:00:00', '2020-04-01 00:00:00', '2022-07-20 00:00:00',
 '2020-11-24 00:00:00', '2021-03-13 00:00:00', '2022-05-07 00:00:00',
 '2023-02-25 00:00:00', '2024-11-17 00:00:00', '2021-02-13 00:00:00',
 '2024-10-26 00:00:00']
Length: 10, dtype: datetime64[ns]
--------------------------------------------------
columna:  monto
Número devalores únicos: 7
Valores únicos: [    -50       0     100 1000000     200    5000     300]
--------------------------------------------------

In [197]:
data_tres.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2155 entries, 1 to 9836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          2155 non-null   int64
 1   cliente_id  2155 non-null   int64
 2   fecha       2155 non-null   datetime64[ns]
 3   monto       2155 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 84.2 KB

## tabla clientes

In [198]:
data_cuatro = pd.read_excel("BD_Prueba.xlsx", sheet_name='clientes')
data_cuatro.head()

   id     nombre   edad
0   1  Cliente_1   32.0
1   2  Cliente_2  150.0
2   3  Cliente_3  200.0
3   4  Cliente_4  150.0
4   5  Cliente_5    NaN

In [199]:
data_cuatro.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2000 non-null   int64
 1   nombre  2000 non-null   object
 2   edad    1791 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 47.0+ KB

In [200]:
print('Datos nulos en el DataFrame cliente:')
data_cuatro.isnull().sum()

Datos nulos en el DataFrame cliente:

id          0
nombre      0
edad      209
dtype: int64

eliminar nulos de edad

In [201]:
data_cuatro = data_cuatro.dropna(subset=['edad'])

In [202]:
unique_values = {col : data_cuatro[col].unique() for col in data_cuatro.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 1791
Valores únicos: [ 1  2  3  4  7  8  9 10 11 12]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 1791
Valores únicos: ['Cliente_1' 'Cliente_2' 'Cliente_3' 'Cliente_4' 'Cliente_7' 'Cliente_8'
 'Cliente_9' 'Cliente_10' 'Cliente_11' 'Cliente_12']
--------------------------------------------------
columna:  edad
Número devalores únicos: 8
Valores únicos: [ 32. 150. 200.  45.  25.  60.  -5. 999.]
--------------------------------------------------

eliminar valores negativos de edad

In [203]:
data_cuatro = data_cuatro[data_cuatro['edad'] >= 0]

eliminar valores mayores a 100 años de edad

In [204]:
data_cuatro = data_cuatro[data_cuatro['edad'] <= 100]

In [161]:
unique_values = {col : data_cuatro[col].unique() for col in data_cuatro.columns}
for col, values in unique_values.items():
    print(f'columna:  {col}')
    print(f'Número devalores únicos: {len(values)}')
    print(f'Valores únicos: {values[:10]}')
    print('-' *50)

columna:  id
Número devalores únicos: 841
Valores únicos: [ 1  8  9 10 12 13 14 17 19 21]
--------------------------------------------------
columna:  nombre
Número devalores únicos: 841
Valores únicos: ['Cliente_1' 'Cliente_8' 'Cliente_9' 'Cliente_10' 'Cliente_12'
 'Cliente_13' 'Cliente_14' 'Cliente_17' 'Cliente_19' 'Cliente_21']
--------------------------------------------------
columna:  edad
Número devalores únicos: 4
Valores únicos: [32. 45. 25. 60.]
--------------------------------------------------

In [205]:
print('Datos nulos en el DataFrame cliente:')
data_cuatro.isnull().sum()

Datos nulos en el DataFrame cliente:

id        0
nombre    0
edad      0
dtype: int64

Guardar el dataframe de excel limpieza

In [206]:
with pd.ExcelWriter('BD_Limpieza.xlsx') as writer:
    data.to_excel(writer, sheet_name='empleados', index=False)
    data_dos.to_excel(writer, sheet_name='departamentos', index=False)
    data_tres.to_excel(writer, sheet_name='compras', index=False)
    data_cuatro.to_excel(writer, sheet_name='clientes', index=False)